{
  "pancakes": {
    "title": "Fluffy American Pancakes",
    "servings": 4,
    "methods": [
      "Sift the flour, baking powder, salt and caster sugar into a large bowl. In a separate bowl or jug, lightly whisk together the milk and egg, then whisk in the melted butter.",
      "Pour the milk mixture into the flour mixture and, using a fork, beat until you have a smooth batter. Any lumps will soon disappear with a little mixing. Let the batter stand for a few minutes.",
      "Heat a non-stick frying pan over a medium heat and add a knob of butter. When it's melted, add a ladle of batter (or two if your frying pan is big enough to cook two pancakes at the same time). It will seem very thick but this is how it should be. Wait until the top of the pancake begins to bubble, then turn it over and cook until both sides are golden brown and the pancake has risen to about 1cm/½in thick.",
      "Repeat until all the batter is used up. You can keep the pancakes warm in a low oven, but they taste best fresh out the pan.",
      "Serve with lashings of real maple syrup and extra butter, if you like."
    ],
    "ingredients": [
      {
        "amount": "135",
        "unit": "g",
        "name": "plain flour"
      },
      {
        "amount": "1",
        "unit": " tsp",
        "name": "baking powder"
      },
      {
        "amount": "0.5",
        "unit": " tsp",
        "name": "salt"
      },
      {
        "amount": "2",
        "unit": " tbsp",
        "name": "caster sugar"
      },
      {
        "amount": "130",
        "unit": "ml",
        "name": "milk"
      },
      {
        "amount": "1",
        "unit": "",
        "name": "large egg, lightly beaten"
      },
      {
        "amount": "2",
        "unit": " tbsp",
        "name": "melted butter (allowed to cool slightly) or olive oil, plus extra for cooking"
      }
    ]
  },
  "tiramisu": {
    "title": "Tiramisu",
    "servings": 6,
    "methods": [
      "Put a <span class=\"ingredient-amount\">568</span>ml pot double cream, <span class=\"ingredient-amount\">250</span>g tub mascarpone, <span class=\"ingredient-amount\">75</spam>ml marsala and <span class=\"ingredient-amount\">5</span> tbsp golden caster sugar in a large bowl.",
      "Whisk until the cream and mascarpone have completely combined and have the consistency of thickly whipped cream.",
      "Pour <span class=\"ingredient-amount\">300</span>ml strong coffee (made with <span class=\"ingredient-amount\">2</span> tbsp coffee granules and <span class=\"ingredient-amount\">300</span>ml boiling water) into a shallow dish.",
      "Dip in a few of the <span class=\"ingredient-amount\">175</span>g pack of sponge fingers at a time, turning for a few secs until they are nicely soaked, but not soggy. Layer these into your dish until you have used half the sponge fingers, then spread over half of the creamy mixture.",
      "Using the coarse side of the grater, grate over most of the <span class=\"ingredient-amount\">25</span>g dark chocolate. Then repeat the layers (you should use up all the coffee), finishing with the creamy layer.",
      "Cover and chill for a few hours or overnight. This can now be kept in the fridge for up to 2 days.",
      "To serve, dust with <span class=\"ingredient-amount\">2</span> tsp cocoa powder and grate over the remainder of the chocolate."
    ],
    "ingredients": [
      {
        "amount": "568",
        "unit": "ml",
        "name": "pot double cream"
      },
      {
        "amount": "250",
        "unit": "g",
        "name": "tub mascarpone"
      },
      {
        "amount": "75",
        "unit": "ml",
        "name": "marsala"
      },
      {
        "amount": "5",
        "unit": " tbsp",
        "name": "golden caster sugar"
      },
      {
        "amount": "300",
        "unit": "ml",
        "name": "strong coffee, made with <span class=\"ingredient-amount\">2</span> tbsp coffee granules and <span class=\"ingredient-amount\">300</span>ml boiling water"
      },
      {
        "amount": "175",
        "unit": "g",
        "name": "pack sponge finger"
      },
      {
        "amount": "25",
        "unit": "g",
        "name": "chunk dark chocolate"
      },
      {
        "amount": "2",
        "unit": "tsp",
        "name": "cocoa powder"
      }
    ]
  }
}
